 STARPGM:    PGM

 CREATEMOD:  CRTRPGMOD  MODULE(SQUAD1/STDMNGSYSR) +
                          SRCFILE(SQUAD1/QSTDMNGSYS) DBGVIEW(*SOURCE)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(STARTDEBUG))
             CRTPGM     PGM(SQUAD1/MAIN) MODULE(SQUAD1/STDMNGSYSR)


 STARTDEBUG: STRDBG     PGM(SQUAD1/MAINPGM) UPDPROD(*YES) OPMSRC(*YES)
             CALL       PGM(SQUAD1/MAIN)
             ENDDBG
 ENDPGM:     ENDPGM